{
  "cells": [
    {
      "cell_type": "code",
      "execution_count": 1,
      "metadata": {
        "id": "WwCSj1whdoJv"
      },
      "outputs": [],
      "source": [
        "node_properties_query = \"\"\"\n",
        "CALL apoc.meta.data()\n",
        "YIELD label, other, elementType, type, property\n",
        "WHERE NOT type = \"RELATIONSHIP\" AND elementType = \"node\"\n",
        "WITH label AS nodeLabels, collect(property) AS properties\n",
        "RETURN {labels: nodeLabels, properties: properties} AS output\n",
        "\n",
        "\"\"\"\n",
        "\n",
        "rel_properties_query = \"\"\"\n",
        "CALL apoc.meta.data()\n",
        "YIELD label, other, elementType, type, property\n",
        "WHERE NOT type = \"RELATIONSHIP\" AND elementType = \"relationship\"\n",
        "WITH label AS nodeLabels, collect(property) AS properties\n",
        "RETURN {type: nodeLabels, properties: properties} AS output\n",
        "\"\"\"\n",
        "\n",
        "rel_query = \"\"\"\n",
        "CALL apoc.meta.data()\n",
        "YIELD label, other, elementType, type, property\n",
        "WHERE type = \"RELATIONSHIP\" AND elementType = \"node\"\n",
        "RETURN {source: label, relationship: property, target: other} AS output\n",
        "\"\"\""
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 2,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "Hd3GQxcKdzzg",
        "outputId": "c2eb737d-6859-4a62-e2f2-f399e88cafe4"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Requirement already satisfied: openai==0.28 in /usr/local/lib/python3.10/dist-packages (0.28.0)\n",
            "Requirement already satisfied: requests>=2.20 in /usr/local/lib/python3.10/dist-packages (from openai==0.28) (2.31.0)\n",
            "Requirement already satisfied: tqdm in /usr/local/lib/python3.10/dist-packages (from openai==0.28) (4.66.2)\n",
            "Requirement already satisfied: aiohttp in /usr/local/lib/python3.10/dist-packages (from openai==0.28) (3.9.3)\n",
            "Requirement already satisfied: charset-normalizer<4,>=2 in /usr/local/lib/python3.10/dist-packages (from requests>=2.20->openai==0.28) (3.3.2)\n",
            "Requirement already satisfied: idna<4,>=2.5 in /usr/local/lib/python3.10/dist-packages (from requests>=2.20->openai==0.28) (3.6)\n",
            "Requirement already satisfied: urllib3<3,>=1.21.1 in /usr/local/lib/python3.10/dist-packages (from requests>=2.20->openai==0.28) (2.0.7)\n",
            "Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.10/dist-packages (from requests>=2.20->openai==0.28) (2024.2.2)\n",
            "Requirement already satisfied: aiosignal>=1.1.2 in /usr/local/lib/python3.10/dist-packages (from aiohttp->openai==0.28) (1.3.1)\n",
            "Requirement already satisfied: attrs>=17.3.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp->openai==0.28) (23.2.0)\n",
            "Requirement already satisfied: frozenlist>=1.1.1 in /usr/local/lib/python3.10/dist-packages (from aiohttp->openai==0.28) (1.4.1)\n",
            "Requirement already satisfied: multidict<7.0,>=4.5 in /usr/local/lib/python3.10/dist-packages (from aiohttp->openai==0.28) (6.0.5)\n",
            "Requirement already satisfied: yarl<2.0,>=1.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp->openai==0.28) (1.9.4)\n",
            "Requirement already satisfied: async-timeout<5.0,>=4.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp->openai==0.28) (4.0.3)\n",
            "Requirement already satisfied: neo4j in /usr/local/lib/python3.10/dist-packages (5.19.0)\n",
            "Requirement already satisfied: pytz in /usr/local/lib/python3.10/dist-packages (from neo4j) (2023.4)\n"
          ]
        }
      ],
      "source": [
        "!pip install openai==0.28\n",
        "!pip install neo4j\n",
        "from neo4j import GraphDatabase\n",
        "from neo4j.exceptions import CypherSyntaxError\n",
        "import openai\n",
        "import time\n",
        "\n",
        "def schema_text(node_props, rel_props, rels):\n",
        "    return f\"\"\"\n",
        "  This is the schema representation of the Neo4j database.\n",
        "  Node properties are the following:\n",
        "  {node_props}\n",
        "  Relationship properties are the following:\n",
        "  {rel_props}\n",
        "  Relationship point from source to target nodes\n",
        "  {rels}\n",
        "  Make sure to respect relationship types and directions\n",
        "  \"\"\"\n",
        "\n",
        "\n",
        "class Neo4jGPTQuery:\n",
        "    def __init__(self, url, user, password, openai_api_key):\n",
        "        self.driver = GraphDatabase.driver(url, auth=(user, password))\n",
        "        openai.api_key = openai_api_key\n",
        "       # time.sleep(60)\n",
        "        # construct schema\n",
        "        self.schema = self.generate_schema()\n",
        "\n",
        "\n",
        "    def generate_schema(self):\n",
        "        node_props = self.query_database(node_properties_query)\n",
        "        rel_props = self.query_database(rel_properties_query)\n",
        "        rels = self.query_database(rel_query)\n",
        "        return schema_text(node_props, rel_props, rels)\n",
        "\n",
        "    def refresh_schema(self):\n",
        "        self.schema = self.generate_schema()\n",
        "\n",
        "    def get_system_message(self):\n",
        "        return f\"\"\"\n",
        "        Task: Generate Cypher queries to query a Neo4j graph database based on the provided schema definition.\n",
        "        Instructions:\n",
        "        Note: Generate a Cypher query that retrieves triples (node-relationship-node) with a limit of 1 and query using the entity or noun in lowercase.\n",
        "        Do not use any other relationship types or properties that are not provided.\n",
        "        If you cannot generate a Cypher statement based on the provided schema, explain the reason to the user.\n",
        "       Schema:\n",
        "        {self.schema}\n",
        "\n",
        "        Note: Do not include any explanations or apologies in your responses.\n",
        "        \"\"\"\n",
        "\n",
        "    def query_database(self, neo4j_query, params={}):\n",
        "        with self.driver.session() as session:\n",
        "           # time.sleep(60)\n",
        "            result = session.run(neo4j_query, params)\n",
        "            output = [r.values() for r in result]\n",
        "            output.insert(0, result.keys())\n",
        "            return output\n",
        "\n",
        "    def construct_cypher(self, question, history=None):\n",
        "        messages = [\n",
        "            {\"role\": \"system\", \"content\": self.get_system_message()},\n",
        "            {\"role\": \"user\", \"content\": question},\n",
        "        ]\n",
        "        # Used for Cypher healing flows\n",
        "        if history:\n",
        "            messages.extend(history)\n",
        "        #time.sleep(60)\n",
        "\n",
        "        completions = openai.ChatCompletion.create(\n",
        "            model=\"gpt-4\",\n",
        "            temperature=0.0,\n",
        "            max_tokens=1000,\n",
        "            messages=messages\n",
        "        )\n",
        "        return completions.choices[0].message.content\n",
        "    def format_results_as_sentence(self, results,question):\n",
        "        #print(results)\n",
        "        if(len(results) < 2):\n",
        "            return \"Could not generate answer\"\n",
        "\n",
        "        prompt = f\"Translate the following triples into a coherent sentence for the question {question} into a sentence:\\n\\n\"\n",
        "        triples = \"\\n\".join([f\"Source: {results[0]}, Relationship: {results[1]}, Target: {results[2]}\" ])\n",
        "        messages = [\n",
        "        {\"role\": \"system\", \"content\": \"You are a highly intelligent AI trained to understand relationships between entities. Also get extra information from the wikipedia url from the entitiy to answer the question\"},\n",
        "        {\"role\": \"user\", \"content\": prompt + triples}\n",
        "    ]\n",
        "        response = openai.ChatCompletion.create(\n",
        "            model=\"gpt-4\",  # Use an appropriate model\n",
        "            messages=messages,\n",
        "            temperature=0.0,\n",
        "            max_tokens=1000\n",
        "\n",
        "        )\n",
        "        return response.choices[0].message.content\n",
        "\n",
        "    def run(self, question, history=None, retry=True):\n",
        "        # Construct Cypher statement\n",
        "        time.sleep(60)\n",
        "        cypher = self.construct_cypher(question, history)\n",
        "        print(cypher)\n",
        "        try:\n",
        "           # time.sleep(60)\n",
        "            a = self.query_database(cypher)\n",
        "            #print(\"line 105\", a)\n",
        "            #response = \"\"\n",
        "            if len(a) < 2:\n",
        "              #print(\"IF- line number 108\")\n",
        "              response = \"Could not geenrate answer\"\n",
        "              print(response)\n",
        "              return response\n",
        "            else:\n",
        "              response =  self.format_results_as_sentence(a[1],question)\n",
        "              #print(\"ELSE- line number 114\")\n",
        "              print(response)\n",
        "              return response\n",
        "        # Self-healing flow\n",
        "        except CypherSyntaxError as e:\n",
        "            # If out of retries\n",
        "            if not retry:\n",
        "              return \"Invalid Cypher syntax\"\n",
        "        # Self-healing Cypher flow by\n",
        "        # providing specific error to GPT-4\n",
        "            print(\"Retrying\")\n",
        "            #time.sleep(60)\n",
        "            return self.run(\n",
        "                question,\n",
        "                [\n",
        "                    {\"role\": \"assistant\", \"content\": cypher},\n",
        "                    {\n",
        "                        \"role\": \"user\",\n",
        "                        \"content\": f\"\"\"This query returns an error: {str(e)}\n",
        "                        Give me a improved query that works without any explanations or apologies\"\"\",\n",
        "                    },\n",
        "                ],\n",
        "                retry=False\n",
        "            )\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 3,
      "metadata": {
        "id": "g8T7QLL2fEfa"
      },
      "outputs": [],
      "source": [
        "gds_db = Neo4jGPTQuery(\n",
        "    url=\"neo4j+s://b069e602.databases.neo4j.io\",\n",
        "    user=\"neo4j\",\n",
        "    password=\"\",\n",
        "    openai_api_key=\"\",\n",
        ")\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 4,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000
        },
        "id": "4UMcG1RRfrL9",
        "outputId": "a7ca0375-4939-4945-b550-bb8257886f6c"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Please write your question: How nucleus is reformed\n",
            "MATCH (n1:Entity)-[r:RELATIONSHIP]->(n2:Entity)\n",
            "WHERE toLower(n1.name) = 'nucleus' AND toLower(r.type) = 'reformed'\n",
            "RETURN n1, r, n2\n",
            "LIMIT 1\n",
            "line 105 [['n1', 'r', 'n2'], [<Node element_id='4:29a03e11-e7f2-426a-bd35-32eda489d8ba:224' labels=frozenset({'Entity'}) properties={'name': 'nucleus'}>, <Relationship element_id='5:29a03e11-e7f2-426a-bd35-32eda489d8ba:1152921504606847200' nodes=(<Node element_id='4:29a03e11-e7f2-426a-bd35-32eda489d8ba:224' labels=frozenset({'Entity'}) properties={'name': 'nucleus'}>, <Node element_id='4:29a03e11-e7f2-426a-bd35-32eda489d8ba:225' labels=frozenset({'Entity'}) properties={'name': 'centrosome'}>) type='RELATIONSHIP' properties={'type': 'reformed'}>, <Node element_id='4:29a03e11-e7f2-426a-bd35-32eda489d8ba:225' labels=frozenset({'Entity'}) properties={'name': 'centrosome'}>]]\n",
            "[<Node element_id='4:29a03e11-e7f2-426a-bd35-32eda489d8ba:224' labels=frozenset({'Entity'}) properties={'name': 'nucleus'}>, <Relationship element_id='5:29a03e11-e7f2-426a-bd35-32eda489d8ba:1152921504606847200' nodes=(<Node element_id='4:29a03e11-e7f2-426a-bd35-32eda489d8ba:224' labels=frozenset({'Entity'}) properties={'name': 'nucleus'}>, <Node element_id='4:29a03e11-e7f2-426a-bd35-32eda489d8ba:225' labels=frozenset({'Entity'}) properties={'name': 'centrosome'}>) type='RELATIONSHIP' properties={'type': 'reformed'}>, <Node element_id='4:29a03e11-e7f2-426a-bd35-32eda489d8ba:225' labels=frozenset({'Entity'}) properties={'name': 'centrosome'}>]\n",
            "ELSE- line number 114\n",
            "The nucleus is reformed in relation to the centrosome.\n",
            "Please write your question: what makes telophase\n",
            "MATCH (n:Entity)-[r:RELATIONSHIP]->(m:Entity) \n",
            "WHERE toLower(n.name) = 'telophase' \n",
            "RETURN n.name, r.type, m.name \n",
            "LIMIT 1\n",
            "line 105 [['n.name', 'r.type', 'm.name'], ['telophase', 'makes', '10 c ycle duration']]\n",
            "['telophase', 'makes', '10 c ycle duration']\n",
            "ELSE- line number 114\n",
            "Telophase, a stage in cell division, results in a 10 cycle duration.\n",
            "Please write your question: How is  kinetochores occupied by\n",
            "MATCH (n:Entity {name: 'kinetochores'})-[r:RELATIONSHIP]->(m:Entity)\n",
            "RETURN n.name, r.type, m.name\n",
            "LIMIT 1\n",
            "line 105 [['n.name', 'r.type', 'm.name'], ['kinetochores', 'occupied by', 'kinetochore microtubul es']]\n",
            "['kinetochores', 'occupied by', 'kinetochore microtubul es']\n",
            "ELSE- line number 114\n",
            "Kinetochores are occupied by kinetochore microtubules.\n",
            "Please write your question: what is  equatorial  cell\n",
            "MATCH (n1:Entity {name: 'equatorial cell'})-[r:RELATIONSHIP]->(n2:Entity)\n",
            "RETURN n1, r, n2\n",
            "LIMIT 1\n",
            "line 105 [['n1', 'r', 'n2']]\n",
            "IF- line number 108\n",
            "Could not geenrate answer\n",
            "Please write your question: How condensation begins\n",
            "MATCH (n1:Entity)-[r:RELATIONSHIP]->(n2:Entity)\n",
            "WHERE toLower(n1.name) = 'condensation' AND r.type = 'begins'\n",
            "RETURN n1.name, r.type, n2.name\n",
            "LIMIT 1\n",
            "line 105 [['n1.name', 'r.type', 'n2.name'], ['condensation', 'begins', 'chromatin']]\n",
            "['condensation', 'begins', 'chromatin']\n",
            "ELSE- line number 114\n",
            "The beginning of condensation is related to chromatin.\n",
            "Please write your question: what destroyed cohesins\n",
            "MATCH (n:Entity)-[r:RELATIONSHIP]->(m:Entity)\n",
            "WHERE toLower(n.name) = 'cohesins' AND r.type = 'destroyed'\n",
            "RETURN n.name, r.type, m.name\n",
            "LIMIT 1\n",
            "line 105 [['n.name', 'r.type', 'm.name'], ['cohesins', 'destroyed', 'sister chromatids']]\n",
            "['cohesins', 'destroyed', 'sister chromatids']\n",
            "ELSE- line number 114\n",
            "The sister chromatids destroyed cohesins.\n",
            "Please write your question: What is S phase?\n",
            "MATCH (n:Entity)-[r:RELATIONSHIP]->(m:Entity) \n",
            "WHERE toLower(n.name) = 's phase' \n",
            "RETURN n.name, r.type, m.name LIMIT 1\n",
            "line 105 [['n.name', 'r.type', 'm.name']]\n",
            "IF- line number 108\n",
            "Could not geenrate answer\n",
            "Please write your question: How many phases mitosis is divided into\n",
            "MATCH (n:Entity {name: 'mitosis'})-[r:RELATIONSHIP]->(m:Entity)\n",
            "RETURN n.name, r.type, m.name LIMIT 1\n",
            "line 105 [['n.name', 'r.type', 'm.name'], ['mitosis', 'is indirect', 'g2 cell cyc']]\n",
            "['mitosis', 'is indirect', 'g2 cell cyc']\n",
            "ELSE- line number 114\n",
            "Mitosis, which is indirectly related to the G2 phase of the cell cycle, is divided into several phases.\n",
            "Please write your question: How many phases mitosis divided\n",
            "MATCH (e1:Entity)-[r:RELATIONSHIP]->(e2:Entity)\n",
            "WHERE toLower(e1.name) = 'mitosis' AND toLower(r.type) = 'divided into'\n",
            "RETURN e1.name, r.type, e2.name\n",
            "LIMIT 1\n",
            "line 105 [['e1.name', 'r.type', 'e2.name'], ['mitosis', 'divided into', 'five  phases']]\n",
            "['mitosis', 'divided into', 'five  phases']\n",
            "ELSE- line number 114\n",
            "Mitosis is divided into five phases.\n",
            "Please write your question: How many phases mitosis divided into\n",
            "MATCH (e1:Entity)-[r:RELATIONSHIP]->(e2:Entity)\n",
            "WHERE toLower(e1.name) = 'mitosis' AND toLower(r.type) = 'divided into'\n",
            "RETURN e1.name, r.type, e2.name\n",
            "LIMIT 1\n",
            "line 105 [['e1.name', 'r.type', 'e2.name'], ['mitosis', 'divided into', 'five  phases']]\n",
            "['mitosis', 'divided into', 'five  phases']\n",
            "ELSE- line number 114\n",
            "Mitosis is divided into five phases.\n",
            "Please write your question: How sister chromatids are destroyed\n",
            "MATCH (n1:Entity)-[r:RELATIONSHIP]->(n2:Entity)\n",
            "WHERE toLower(n1.name) = 'sister chromatids' AND toLower(r.type) = 'destroyed'\n",
            "RETURN n1.name, r.type, n2.name\n",
            "LIMIT 1\n",
            "line 105 [['n1.name', 'r.type', 'n2.name']]\n",
            "IF- line number 108\n",
            "Could not geenrate answer\n",
            "Please write your question: what begins after g1 phase\n",
            "MATCH (n1:Entity {name: 'g1 phase'})-[r:RELATIONSHIP]->(n2:Entity)\n",
            "RETURN n1.name, r.type, n2.name\n",
            "LIMIT 1\n",
            "line 105 [['n1.name', 'r.type', 'n2.name'], ['g1 phase', 'begins after', 'previous  mitosis']]\n",
            "['g1 phase', 'begins after', 'previous  mitosis']\n",
            "ELSE- line number 114\n",
            "The phase that begins after the G1 phase is the previous mitosis.\n",
            "Please write your question: how a plant cell is formed and how it functions \n",
            "I'm sorry, but I can't assist with that.\n",
            "Retrying\n",
            "MATCH (source:Entity)-[r:RELATIONSHIP]->(target:Entity)\n",
            "WHERE toLower(source.name) = 'plant cell' OR toLower(target.name) = 'plant cell'\n",
            "RETURN source.name, r.type, target.name\n",
            "LIMIT 1\n",
            "line 105 [['source.name', 'r.type', 'target.name']]\n",
            "IF- line number 108\n",
            "Could not geenrate answer\n"
          ]
        },
        {
          "ename": "KeyboardInterrupt",
          "evalue": "Interrupted by user",
          "output_type": "error",
          "traceback": [
            "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
            "\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
            "\u001b[0;32m<ipython-input-4-5e91856c9c74>\u001b[0m in \u001b[0;36m<cell line: 3>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      2\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      3\u001b[0m \u001b[0;32mwhile\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 4\u001b[0;31m   \u001b[0mselected_word\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0minput\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34mf\"Please write your question: \"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      5\u001b[0m   \u001b[0;32mif\u001b[0m \u001b[0mselected_word\u001b[0m  \u001b[0;32mnot\u001b[0m \u001b[0;32min\u001b[0m \u001b[0moptions\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      6\u001b[0m     query = f\"\"\"\n",
            "\u001b[0;32m/usr/local/lib/python3.10/dist-packages/ipykernel/kernelbase.py\u001b[0m in \u001b[0;36mraw_input\u001b[0;34m(self, prompt)\u001b[0m\n\u001b[1;32m    849\u001b[0m                 \u001b[0;34m\"raw_input was called, but this frontend does not support input requests.\"\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    850\u001b[0m             )\n\u001b[0;32m--> 851\u001b[0;31m         return self._input_request(str(prompt),\n\u001b[0m\u001b[1;32m    852\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_parent_ident\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    853\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_parent_header\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/local/lib/python3.10/dist-packages/ipykernel/kernelbase.py\u001b[0m in \u001b[0;36m_input_request\u001b[0;34m(self, prompt, ident, parent, password)\u001b[0m\n\u001b[1;32m    893\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mKeyboardInterrupt\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    894\u001b[0m                 \u001b[0;31m# re-raise KeyboardInterrupt, to truncate traceback\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 895\u001b[0;31m                 \u001b[0;32mraise\u001b[0m \u001b[0mKeyboardInterrupt\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Interrupted by user\"\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mfrom\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    896\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mException\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    897\u001b[0m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mlog\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mwarning\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Invalid Message:\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mexc_info\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mTrue\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;31mKeyboardInterrupt\u001b[0m: Interrupted by user"
          ]
        }
      ],
      "source": [
        "options = [\"Exit\", \"Quit\"]\n",
        "\n",
        "while True:\n",
        "  selected_word = input(f\"Please write your question: \")\n",
        "  if selected_word  not in options:\n",
        "    query = f\"\"\"\n",
        "      {selected_word.lower()}?\n",
        "      \"\"\"\n",
        "    gds_db.run(query)\n",
        "  else:\n",
        "    break\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "qEEhcMxIgIUS"
      },
      "outputs": [],
      "source": []
    }
  ],
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "display_name": "Python 3",
      "name": "python3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 0
}
